# ViewSchemaSettingForSystemTemplate Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ViewSchemaSettingForSystemTemplate Property
ParameterTypeId Class See Also
---
"System Color Schemes"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ViewSchemaSettingForSystemTemplate { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ViewSchemaSettingForSystemTemplate As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ViewSchemaSettingForSystemTemplate {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace